{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "batch_input_shape": [null, 1, 25, 25], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "C01", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 64, "kernel_size": [3, 3], "dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_21"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "name": "C02", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 64, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "name": "C03", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 128, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_22"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "name": "C04", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 128, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_29"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_23"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "name": "C05", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 128, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_30"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_24"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "name": "dense_16", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "name": "dense_17", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "name": "dense_18", "trainable": true}}]}