{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activity_regularizer": null, "filters": 64, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "batch_input_shape": [null, 1, 25, 25], "name": "C01", "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "padding": "same", "trainable": true, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 64, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "data_format": "channels_first", "name": "C02", "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "data_format": "channels_first", "name": "C03", "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "data_format": "channels_first", "name": "C04", "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "data_format": "channels_first", "name": "C05", "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "linear", "name": "dense_1", "units": 512, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "linear", "name": "dense_2", "units": 512, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "linear", "name": "dense_3", "units": 1, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": {"config": {"l2": 9.999999747378752e-06, "l1": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}], "class_name": "Sequential"}