{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["activation_6", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 1, 48, 48], "name": "input_1"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "dropout_5", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_5", "trainable": true, "seed": null, "rate": 0.2}}, {"name": "conv2d_2", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "dropout_6", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_6", "trainable": true, "seed": null, "rate": 0.2}}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 128, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "dropout_7", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_7", "trainable": true, "seed": null, "rate": 0.2}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 128, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_6", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "concatenate_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "dropout_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_8", "trainable": true, "seed": null, "rate": 0.2}}, {"name": "conv2d_8", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}}, {"name": "concatenate_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": 1}}, {"name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "dropout_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_9", "trainable": true, "seed": null, "rate": 0.2}}, {"name": "conv2d_10", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_10", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "data_format": "channels_first", "filters": 2, "activation": "relu", "bias_regularizer": null, "kernel_size": [1, 1], "name": "conv2d_11", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "reshape_1", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [2, 2304]}}, {"name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}}, {"name": "activation_6", "inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]]}}