{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_56", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 48, 48], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3]}}, {"name": "dropout_33", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_33"}}, {"name": "conv2d_2", "inbound_nodes": [[["dropout_33", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3]}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3]}}, {"name": "dropout_34", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_34"}}, {"name": "conv2d_4", "inbound_nodes": [[["dropout_34", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3]}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3]}}, {"name": "dropout_35", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_35"}}, {"name": "conv2d_6", "inbound_nodes": [[["dropout_35", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3]}}, {"name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_1"}}, {"name": "concatenate_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}}, {"name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3]}}, {"name": "dropout_36", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_36"}}, {"name": "conv2d_8", "inbound_nodes": [[["dropout_36", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3]}}, {"name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "size": [2, 2], "name": "up_sampling2d_2"}}, {"name": "concatenate_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}}, {"name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3]}}, {"name": "dropout_37", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_37"}}, {"name": "conv2d_10", "inbound_nodes": [[["dropout_37", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3]}}, {"name": "conv2d_11", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 2, "kernel_size": [1, 1]}}, {"name": "reshape_1", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "config": {"trainable": true, "target_shape": [2, 2304], "name": "reshape_1"}}, {"name": "permute_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "config": {"trainable": true, "dims": [2, 1], "name": "permute_1"}}, {"name": "activation_56", "inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_56"}}]}}