{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "batch_input_shape": [null, 1, 25, 25], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "C01", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 16, "kernel_size": [4, 4], "dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_51"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "MP01", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "C02", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 32, "kernel_size": [4, 4]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_52"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "MP02", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "trainable": true, "name": "C03", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "filters": 64, "kernel_size": [4, 4]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_53"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "padding": "valid", "name": "MP04", "data_format": "channels_first"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_13"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "name": "dense_23", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_54"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "name": "dense_24", "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_55"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-06}}, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "bias_constraint": null, "name": "dense_25", "trainable": true}}]}